In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7.db

In [3]:
%sql select * from sqlite_master;

 * sqlite:///db_univ7.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None)]

In [4]:
%sql select * from section where semester = 'Spring' and year= 2018

 * sqlite:///db_univ7.db
Done.

[('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D')]

In [5]:
%%sql 
select *
from section as S
where semester = 'Fall' and year= 2017

 * sqlite:///db_univ7.db
Done.

[('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

In [6]:
%%sql 
select course_id from section where semester = 'Fall' and year= 2017
intersect 
select course_id from section where semester = 'Spring' and year= 2018

 * sqlite:///db_univ7.db
Done.

[('CS-101',)]

In [7]:
%%sql select course_id
from section as S
where semester = 'Fall' and year= 2017 and
exists (select * from section as T where semester = 'Spring' and year= 2018 and S.course_id= T.course_id);

 * sqlite:///db_univ7.db
Done.

[('CS-101',)]

In [8]:
%%sql select distinct S.ID, S.name
from student as S
where not exists (select course_id from course where dept_name = 'Biology' except
                                select T.course_id from takes as T where S.ID = T.ID);

 * sqlite:///db_univ7.db
Done.

[]

In [9]:
%sql select * from course where dept_name = 'Biology'

 * sqlite:///db_univ7.db
Done.

[('BIO-101', 'Intro. to Biology', 'Biology', 4),
 ('BIO-301', 'Genetics', 'Biology', 4),
 ('BIO-399', 'Computational Biology', 'Biology', 3)]

In [10]:
%sql select * from takes

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [11]:
%sql insert into takes values ('98988','BIO-399',1,'Summer','2018','A')

 * sqlite:///db_univ7.db
1 rows affected.

[]

In [12]:
%%sql select distinct S.ID, S.name
from student as S
where not exists (select course_id from course where dept_name = 'Biology' except
                                select T.course_id from takes as T where S.ID = T.ID);

 * sqlite:///db_univ7.db
Done.

[('98988', 'Tanaka')]

In [13]:
%sql select * from takes

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None),
 ('98988', 'BIO-399', '1', 'Summer', 2018, 'A')]

In [14]:
%sql delete from takes where ID = '98988' and course_id = 'BIO-399'

 * sqlite:///db_univ7.db
1 rows affected.

[]

In [15]:
%sql select * from takes

 * sqlite:///db_univ7.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [16]:
%sql select * from section

 * sqlite:///db_univ7.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A')]

In [17]:
%%sql select T.course_id 
from course as T 
where unique (select R.course_id
              from section as R
              where T.course_id= R.course_id
              and R.year = 2009);

 * sqlite:///db_univ7.db
(sqlite3.OperationalError) near "unique": syntax error
[SQL: select T.course_id from course as T
where unique (select R.course_id
              from section as R
              where T.course_id= R.course_id
              and R.year = 2009);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [18]:
%%sql select T.course_id 
from course as T 
where 1>= (select count(R.course_id)
              from section as R
              where T.course_id= R.course_id
              and R.year = 2009);

 * sqlite:///db_univ7.db
Done.

[('BIO-101',),
 ('BIO-301',),
 ('BIO-399',),
 ('CS-101',),
 ('CS-190',),
 ('CS-315',),
 ('CS-319',),
 ('CS-347',),
 ('EE-181',),
 ('FIN-201',),
 ('HIS-351',),
 ('MU-199',),
 ('PHY-101',)]

In [19]:
%%sql 
select dept_name, avg_salary 
from (select dept_name, avg (salary) as avg_salary from instructor group by dept_name) 
where avg_salary > 42000;

 * sqlite:///db_univ7.db
Done.

[('Biology', 84000.0),
 ('Comp. Sci.', 77333.33333333333),
 ('Elec. Eng.', 80000.0),
 ('Finance', 85000.0),
 ('History', 61000.0),
 ('Physics', 91000.0)]

In [20]:
%%sql
with maxBudget (MM) as (select max(budget) from department)
select * from maxBudget as M, department as D
where M.MM = D.budget

 * sqlite:///db_univ7.db
Done.

[(120000, 'Finance', 'Painter', 120000)]

In [21]:
%%sql 
with max_budget (mbudget) as (select max(budget) from department) 
select dept_name, budget 
from department, max_budget 
where department.budget = max_budget.mbudget;

 * sqlite:///db_univ7.db
Done.

[('Finance', 120000)]

In [22]:
%sql select * from maxBudget

 * sqlite:///db_univ7.db
(sqlite3.OperationalError) no such table: maxBudget
[SQL: select * from maxBudget]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [23]:
%%sql with dept_total (dept_name, value) as 
(select dept_name, sum(salary) 
 from instructor group by dept_name),
dept_total_avg(value) as 
(select avg(value) 
 from dept_total)
select dept_name 
from dept_total, dept_total_avg 
where dept_total.value >= dept_total_avg.value;

 * sqlite:///db_univ7.db
Done.

[('Biology',), ('Comp. Sci.',), ('Finance',), ('Physics',)]

In [24]:
%sql select * from department

 * sqlite:///db_univ7.db
Done.

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

In [25]:
%%sql select dept_name, 
(select count(*) 
 from instructor 
 where department.dept_name = instructor.dept_name)
as num_instructors
from department;

 * sqlite:///db_univ7.db
Done.

[('Biology', 3),
 ('Comp. Sci.', 3),
 ('Elec. Eng.', 1),
 ('Finance', 2),
 ('History', 2),
 ('Music', 1),
 ('Physics', 2)]

In [26]:
%sql sqlite:///db_univ7_2.db

In [27]:
%%sql delete from instructor
where dept_name= 'Finance';

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
2 rows affected.

[]

In [28]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('15151', 'Mozart', 'Music', 40000),
 ('22222', 'Einstein', 'Physics', 95000),
 ('32343', 'El Said', 'History', 60000),
 ('33456', 'Gold', 'Physics', 87000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('76766', 'Crick', 'Biology', 72000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000),
 ('99998', 'Lee%', 'Biology', 90000),
 ('99999', 'Lee2', 'Biology', 90000)]

In [30]:
%sql select * from department

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('Biology', 'Watson', 90000),
 ('Comp. Sci.', 'Taylor', 100000),
 ('Elec. Eng.', 'Taylor', 85000),
 ('Finance', 'Painter', 120000),
 ('History', 'Painter', 50000),
 ('Music', 'Packard', 80000),
 ('Physics', 'Watson', 70000)]

In [31]:
%%sql delete from instructor 
where dept_name in (select dept_name from department where building = 'Watson');

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
5 rows affected.

[]

In [32]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('10101', 'Srinivasan', 'Comp. Sci.', 65000),
 ('15151', 'Mozart', 'Music', 40000),
 ('32343', 'El Said', 'History', 60000),
 ('45565', 'Katz', 'Comp. Sci.', 75000),
 ('58583', 'Califieri', 'History', 62000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [33]:
%%sql delete from instructor
where salary < (select avg (salary) 
                           from instructor);

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
4 rows affected.

[]

In [34]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000)]

In [38]:
%%sql insert into instructor select ID, name, dept_name, 38000 
from   student where  dept_name = 'Comp. Sci.' and tot_cred > 74;

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
1 rows affected.

[]

In [40]:
%sql select * from student

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 38),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [41]:
%sql update student set tot_cred = 150 where ID = 55739

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
1 rows affected.

[]

In [42]:
%sql select * from student

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 150),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [43]:
%%sql insert into instructor select ID, name, dept_name, 38000 
from   student where  dept_name = 'Music' and tot_cred > 144;

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
1 rows affected.

[]

In [44]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000),
 ('00128', 'Zhang', 'Comp. Sci.', 38000),
 ('55739', 'Sanchez', 'Music', 38000)]

In [45]:
%%sql update instructor
set salary = salary * 1.05
where salary <  (select avg (salary) from instructor);

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
2 rows affected.

[]

In [46]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('45565', 'Katz', 'Comp. Sci.', 75000),
 ('83821', 'Brandt', 'Comp. Sci.', 92000),
 ('98345', 'Kim', 'Elec. Eng.', 80000),
 ('00128', 'Zhang', 'Comp. Sci.', 39900),
 ('55739', 'Sanchez', 'Music', 39900)]

In [47]:
%%sql update instructor 
set salary = case when salary <= 75000 then salary * 1.05 else salary * 1.03 end

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
5 rows affected.

[]

In [48]:
%sql select * from instructor

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('45565', 'Katz', 'Comp. Sci.', 78750),
 ('83821', 'Brandt', 'Comp. Sci.', 94760),
 ('98345', 'Kim', 'Elec. Eng.', 82400),
 ('00128', 'Zhang', 'Comp. Sci.', 41895),
 ('55739', 'Sanchez', 'Music', 41895)]

In [49]:
%sql select * from student

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 102),
 ('12345', 'Shankar', 'Comp. Sci.', 32),
 ('19991', 'Brandt', 'History', 80),
 ('23121', 'Chavez', 'Finance', 110),
 ('44553', 'Peltier', 'Physics', 56),
 ('45678', 'Levy', 'Physics', 46),
 ('54321', 'Williams', 'Comp. Sci.', 54),
 ('55739', 'Sanchez', 'Music', 150),
 ('70557', 'Snow', 'Physics', 0),
 ('76543', 'Brown', 'Comp. Sci.', 58),
 ('76653', 'Aoi', 'Elec. Eng.', 60),
 ('98765', 'Bourikas', 'Elec. Eng.', 98),
 ('98988', 'Tanaka', 'Biology', 120)]

In [51]:
%%sql update student as S 
set tot_cred = 
(select sum(credits) from takes, course 
 where takes.course_id = course.course_id and S.ID = takes.ID and takes.grade <> 'F' and takes.grade is not null);

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
13 rows affected.

[]

In [52]:
%sql select * from student

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 7),
 ('12345', 'Shankar', 'Comp. Sci.', 14),
 ('19991', 'Brandt', 'History', 3),
 ('23121', 'Chavez', 'Finance', 3),
 ('44553', 'Peltier', 'Physics', 4),
 ('45678', 'Levy', 'Physics', 7),
 ('54321', 'Williams', 'Comp. Sci.', 8),
 ('55739', 'Sanchez', 'Music', 3),
 ('70557', 'Snow', 'Physics', None),
 ('76543', 'Brown', 'Comp. Sci.', 7),
 ('76653', 'Aoi', 'Elec. Eng.', 3),
 ('98765', 'Bourikas', 'Elec. Eng.', 7),
 ('98988', 'Tanaka', 'Biology', 4)]

In [34]:
%%sql update student as S 
set tot_cred = 
(select case when sum(credits) is not null then sum(credits) else 0 end
 from takes, course 
 where takes.course_id = course.course_id and S.ID = takes.ID and takes.grade <> 'F' and takes.grade is not null);

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
13 rows affected.

[]

In [53]:
%sql select * from student

   sqlite:///db_univ7.db
 * sqlite:///db_univ7_2.db
Done.

[('00128', 'Zhang', 'Comp. Sci.', 7),
 ('12345', 'Shankar', 'Comp. Sci.', 14),
 ('19991', 'Brandt', 'History', 3),
 ('23121', 'Chavez', 'Finance', 3),
 ('44553', 'Peltier', 'Physics', 4),
 ('45678', 'Levy', 'Physics', 7),
 ('54321', 'Williams', 'Comp. Sci.', 8),
 ('55739', 'Sanchez', 'Music', 3),
 ('70557', 'Snow', 'Physics', None),
 ('76543', 'Brown', 'Comp. Sci.', 7),
 ('76653', 'Aoi', 'Elec. Eng.', 3),
 ('98765', 'Bourikas', 'Elec. Eng.', 7),
 ('98988', 'Tanaka', 'Biology', 4)]